app/views/subs/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
<ul>
  <li> Moderator: <%= User.find(@sub.user_id).username %> </li>