app/controllers/subs_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."user_id" = $1 AND "subs"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def edit
    @sub = current_user.subs.find(params[:id])

SELECT  "subs".* FROM "subs" WHERE "subs"."user_id" = $1 AND "subs"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "title" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["title", "NBA SAM WAS HERE"], ["updated_at", "2019-02-06 00:36:00.615790"], ["id", 1]]
---
  def update
    @sub = current_user.subs.find(params[:id])
    if @sub.update_attributes(sub_params)